---
kind: property
id: P:Autodesk.Revit.DB.EvaluatedParameter.HasValue
source: html/1dada6c5-7d11-0fe8-f17e-e52116f9cb15.htm
---
# Autodesk.Revit.DB.EvaluatedParameter.HasValue Property

This property is true when the parameter value was successfully obtained, false otherwise.

## Syntax (C#)
```csharp
public bool HasValue { get; }
```